tap "carlocab/personal"
tap "cj-bc/cj-bc"
tap "cloudfoundry/tap"
tap "fumiyas/echo-sd"
tap "genkiroid/cert"
tap "github/gh"
tap "go-delve/delve"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "hudochenkov/sshpass"
tap "jlhonora/lsusb"
tap "microsoft/mssql-release"
tap "netbirdio/tap"
tap "petere/postgresql"
tap "railwaycat/emacsmacport"
tap "ravenac95/sudolikeaboss"
tap "rgerganov/footswitch", "https://github.com/rgerganov/footswitch.git"
tap "sanemat/font"
tap "shivammathur/php"
tap "soracom/soracom-cli"
tap "stevenpack/tap"
tap "ynqa/tap"
brew "act"
brew "amazon-ecs-cli"
brew "libyaml"
brew "readline", link: true
brew "xz"
brew "ansible"
brew "libpng"
brew "libtiff"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "apr-util"
brew "arp-scan"
brew "asciinema"
brew "gettext"
brew "glib"
brew "autoconf"
brew "autojump"
brew "automake"
brew "awscli"
brew "axel"
brew "bash"
brew "libssh2"
brew "oniguruma"
brew "bat"
brew "berkeley-db", link: true
brew "pixman"
brew "cairo"
brew "harfbuzz"
brew "bfg"
brew "json-c"
brew "bind"
brew "binutils"
brew "binwalk"
brew "boost"
brew "bzip2"
brew "ghc"
brew "cabal-install"
brew "gcc"
brew "suite-sparse"
brew "tbb"
brew "ceres-solver"
brew "pkgconf"
brew "cliclick"
brew "cmake"
brew "ruby"
brew "cocoapods"
brew "libtool"
brew "freetds"
brew "gd"
brew "php", link: false
brew "composer"
brew "coreutils"
brew "cowsay"
brew "cpanminus"
brew "cscope"
brew "ctags"
brew "deno"
brew "diff-so-fancy"
brew "direnv"
brew "dnsmasq"
brew "docker", link: false
brew "e2fsprogs"
brew "libevent"
brew "folly"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "edencommon"
brew "elan-init"
brew "envchain"
brew "erlang"
brew "exiftool"
brew "expect"
brew "eza"
brew "fd"
brew "felinks"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "libass"
brew "pango"
brew "srt"
brew "tesseract"
brew "zeromq"
brew "ffmpeg"
brew "ffmpeg@4"
brew "figlet"
brew "flow"
brew "fontforge"
brew "gdk-pixbuf"
brew "gh"
brew "libidn"
brew "ghostscript"
brew "ghq"
brew "gibo"
brew "git"
brew "git-extras"
brew "git-filter-repo"
brew "git-lfs"
brew "glslang"
brew "gnu-sed"
brew "go"
brew "gobject-introspection"
brew "sdl2_image"
brew "gource"
brew "gpsd"
brew "netpbm"
brew "gts"
brew "librsvg"
brew "graphviz"
brew "gstreamer"
brew "guetzli"
brew "guile"
brew "haskell-stack"
brew "httpflow"
brew "httpie"
brew "hunspell"
brew "shared-mime-info"
brew "libheif"
brew "imagemagick"
brew "imagemagick@6"
brew "imagesnap"
brew "ios-deploy"
brew "iproute2mac"
brew "jansson"
brew "jenv"
brew "jid"
brew "jpeg"
brew "jpegoptim"
brew "jq"
brew "kotlin"
brew "leiningen"
brew "lha"
brew "libfido2"
brew "libmagic"
brew "libproxy"
brew "libraqm"
brew "libwebsockets"
brew "libxmlsec1"
brew "lua"
brew "lv"
brew "lynx"
brew "macvim", link: false
brew "mas"
brew "mercurial"
brew "minicom"
brew "minikube"
brew "mise"
brew "mono-libgdiplus"
brew "mosquitto"
brew "mvfst"
brew "protobuf"
brew "mysql"
brew "n"
brew "neovim"
brew "nghttp2"
brew "nginx"
brew "nkf"
brew "nmap"
brew "node", link: false
brew "numpy"
brew "nyancat"
brew "oath-toolkit"
brew "qt"
brew "pyqt"
brew "vtk"
brew "opencv"
brew "openjdk@17"
brew "pacvim"
brew "pandoc"
brew "peco"
brew "perl"
brew "pillow"
brew "pipenv"
brew "pngcheck"
brew "pngquant"
brew "portaudio"
brew "postgresql@12"
brew "postgresql@13"
brew "postgresql@14"
brew "pup"
brew "pwgen"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.9"
brew "python-tk@3.9"
brew "python@3.10"
brew "python@3.11"
brew "qt@5"
brew "ruby-build"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "redis"
brew "rlwrap"
brew "rmtrash"
brew "scons"
brew "shadowsocks-libev"
brew "sip"
brew "sl"
brew "socat"
brew "source-highlight"
brew "sox"
brew "starship"
brew "subversion"
brew "swiftlint"
brew "tcl-tk"
brew "telnet"
brew "terminal-notifier"
brew "terraform"
brew "tig"
brew "tmux"
brew "tofrodos"
brew "tokei"
brew "tree"
brew "vim", args: ["HEAD"], link: false
brew "w3m"
brew "watch"
brew "watchman"
brew "wdiff"
brew "wget"
brew "wimlib"
brew "xdotool"
brew "yt-dlp"
brew "zplug"
brew "zsh"
brew "carlocab/personal/unrar"
brew "cloudfoundry/tap/cf-cli"
brew "fumiyas/echo-sd/echo-sd"
brew "heroku/brew/heroku"
brew "hudochenkov/sshpass/sshpass"
brew "jlhonora/lsusb/lsusb"
brew "netbirdio/tap/netbird"
brew "shivammathur/php/php@7.4", link: true
brew "stevenpack/tap/asroute"
brew "ynqa/tap/jnv"
cask "basictex"
cask "bathyscaphe"
cask "coolterm"
cask "franz"
cask "gcloud-cli"
cask "intellij-idea"
cask "mitmproxy"
cask "netbird-ui"
cask "ngrok"
cask "pycharm"
cask "vagrant"
cask "xquartz"
mas "Actions", id: 1586435171
mas "Audio Record - Audio Recorder1", id: 987725641
mas "BetterSnapTool", id: 417375580
mas "Cyberduck", id: 409222199
mas "Developer", id: 640199958
mas "Dipper", id: 6450242673
mas "Evernote", id: 406056744
mas "Folder Peek", id: 1615988943
mas "GarageBand", id: 682658836
mas "GrandPerspective", id: 1111570163
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LadioCast", id: 411213048
mas "LanScan", id: 472226235
mas "LINE", id: 539883307
mas "MindNode", id: 1289197285
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Perculia", id: 1462633284
mas "QR Capture", id: 1369524274
mas "ScanSnap Cloud", id: 1035516352
mas "Shazam", id: 897118787
mas "Silicon Info", id: 1542271266
mas "Sim Daltonism", id: 693112260
mas "Slack", id: 803453959
mas "SnailSVN Lite", id: 1063090543
mas "TEPRA SMA3", id: 704088911
mas "The Unarchiver", id: 425424353
mas "Tomato One", id: 907364780
mas "Windows App", id: 1295203466
mas "Xcode", id: 497799835
vscode "aki77.rails-db-schema"
vscode "almightychaosdev.maficious-theme"
vscode "amlovey.shaderlabvscodefree"
vscode "amodio.amethyst-theme"
vscode "anozon.maai-cursor"
vscode "anthropic.claude-code"
vscode "arjun.swagger-viewer"
vscode "astro-build.astro-vscode"
vscode "asvetliakov.vscode-neovim"
vscode "asyncapi.asyncapi-preview"
vscode "ayakosky.fluffy-dark-theme"
vscode "aykutsarac.jsoncrack-vscode"
vscode "azemoh.one-monokai"
vscode "berublan.vscode-log-viewer"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "blanu.vscode-styled-jsx"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "bung87.rails"
vscode "bung87.vscode-gemfile"
vscode "carlos18mz.cyberpunk-2077-rebuild"
vscode "castwide.solargraph"
vscode "chanhx.crabviz"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "circledev.glsl-canvas"
vscode "clinyong.vscode-css-modules"
vscode "cpylua.language-postcss"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "dseight.disasexpl"
vscode "dtoplak.vscode-glsllint"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "emeraldwalk.runonsave"
vscode "esafirm.kotlin-formatter"
vscode "esbenp.prettier-vscode"
vscode "felixfbecker.php-intellisense"
vscode "file-icons.file-icons"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "formulahendry.github-actions"
vscode "fwcd.kotlin"
vscode "gamunu.vscode-yarn"
vscode "gcazaciuc.vscode-flow-ide"
vscode "george-alisson.html-preview-vscode"
vscode "georgewfraser.vscode-javac"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.copilot-labs"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "gitpod.gitpod-desktop"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "gordonsmith.observable-js"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "haskell.haskell"
vscode "hbenl.vscode-test-explorer"
vscode "hridoy.rails-snippets"
vscode "humao.rest-client"
vscode "idered.npm"
vscode "ilich8086.classic-asp"
vscode "jakearl.search-editor-apply-changes"
vscode "janisdd.vscode-edit-csv"
vscode "jebbs.plantuml"
vscode "jerrygoyal.shortcut-menu-bar"
vscode "jonkwheeler.styled-components-snippets"
vscode "julialang.language-julia"
vscode "justusadam.language-haskell"
vscode "kaiwood.endwise"
vscode "kalitaalexey.vscode-rust"
vscode "kelvin.vscode-sshfs"
vscode "kenhowardpdx.vscode-gist"
vscode "larxx.github-blue"
vscode "leanprover.lean4"
vscode "luke-zhang-04.processing-vscode"
vscode "mariorodeghiero.vue-theme"
vscode "mathiasfrohlich.kotlin"
vscode "maximedenes.vscoq"
vscode "mechatroner.rainbow-csv"
vscode "misogi.ruby-rubocop"
vscode "mjmcloug.vscode-elixir"
vscode "mkloubert.vscode-http-client"
vscode "mosapride.zenkaku"
vscode "moshfeu.compare-folders"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-pyright.pyright"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-serial-monitor"
vscode "ms-vscode.vscode-speech"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mysql"
vscode "mtxr.sqltools-driver-pg"
vscode "mtxr.sqltools-driver-sqlite"
vscode "narumincho.definy"
vscode "naumovs.color-highlight"
vscode "negokaz.zenn-editor"
vscode "njqdev.vscode-python-typehint"
vscode "noku.rails-run-spec-vscode"
vscode "oderwat.indent-rainbow"
vscode "onecentlin.laravel-blade"
vscode "openai.chatgpt"
vscode "orta.vscode-jest"
vscode "osteele.p5-server"
vscode "oxc.oxc-vscode"
vscode "pbkit.vscode-pbkit"
vscode "peakchen90.open-html-in-browser"
vscode "phoenisx.cssvar"
vscode "pkief.material-icon-theme"
vscode "pleiades.java-extension-pack-jdk"
vscode "postman.postman-for-vscode"
vscode "prisma.prisma"
vscode "pucelle.run-on-save"
vscode "quicktype.quicktype"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rooveterinaryinc.roo-cline"
vscode "ruakr.ftp-kr"
vscode "rust-lang.rust-analyzer"
vscode "ryu1kn.partial-diff"
vscode "samuelcolvin.jinjahtml"
vscode "saoudrizwan.claude-dev"
vscode "shardulm94.trailing-spaces"
vscode "shopify.ruby-lsp"
vscode "sianglim.slim"
vscode "silesky.toggle-boolean"
vscode "simonsiefke.svg-preview"
vscode "slevesque.shader"
vscode "stoplight.spectral"
vscode "streetsidesoftware.code-spell-checker"
vscode "stuart.unique-window-colors"
vscode "styled-components.vscode-styled-components"
vscode "swellaby.vscode-rust-test-adapter"
vscode "syler.sass-indented"
vscode "takuyaw-w.swapman"
vscode "tamasfe.even-better-toml"
vscode "tamj0rd2.ts-quickfixes-extension"
vscode "toba.vsfire"
vscode "tobiah.language-pde"
vscode "tommasov.hosts"
vscode "tomoki1207.pdf"
vscode "tomoyukim.vscode-mermaid-editor"
vscode "tonybaloney.vscode-pets"
vscode "unifiedjs.vscode-mdx"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "wangtao0101.vscode-js-import"
vscode "wegman12.cfg-language-features"
vscode "wferris.vs-asp-classic"
vscode "whizkydee.material-palenight-theme"
vscode "willluke.nextjs"
vscode "wscats.cors-browser"
vscode "wwmyers.hackpot"
vscode "xabikos.javascriptsnippets"
vscode "xaver.clang-format"
vscode "xyc.vscode-mdx-preview"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.vscode-styled-jsx-languageserver-scss"
