tap "caskroom/cask"
tap "cj-bc/cj-bc"
tap "cloudfoundry/tap"
tap "fumiyas/echo-sd"
tap "genkiroid/cert"
tap "github/gh"
tap "go-delve/delve"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jlhonora/lsusb"
tap "microsoft/mssql-release"
tap "petere/postgresql"
tap "railwaycat/emacsmacport"
tap "rgerganov/footswitch", "https://github.com/rgerganov/footswitch.git"
tap "sanemat/font"
tap "stevenpack/tap"
brew "act"
brew "amazon-ecs-cli"
brew "readline", link: true
brew "xz"
brew "python@3.11"
brew "libyaml"
brew "ansible"
brew "libpng"
brew "libtiff"
brew "apr-util"
brew "arp-scan"
brew "asciinema"
brew "autoconf"
brew "autojump"
brew "automake"
brew "awscli"
brew "gettext"
brew "openssl@1.1"
brew "axel"
brew "bash"
brew "bat"
brew "berkeley-db", link: true
brew "bfg"
brew "bind"
brew "binutils"
brew "glib"
brew "pkg-config"
brew "pixman"
brew "python@3.9"
brew "cairo"
brew "gcc"
brew "harfbuzz"
brew "libraqm"
brew "numpy"
brew "tcl-tk"
brew "pillow"
brew "binwalk"
brew "boost"
brew "bzip2"
brew "ghc"
brew "cabal-install"
brew "suite-sparse"
brew "tbb"
brew "ceres-solver"
brew "cliclick"
brew "cmake"
brew "cocoapods"
brew "composer"
brew "coreutils"
brew "cowsay"
brew "cpanminus"
brew "cscope"
brew "ctags"
brew "libssh2"
brew "openldap"
brew "curl"
brew "deno"
brew "diff-so-fancy"
brew "direnv"
brew "docker", link: false
brew "e2fsprogs"
brew "libevent"
brew "folly"
brew "edencommon"
brew "envchain"
brew "jpeg", link: true
brew "erlang"
brew "exa"
brew "exiftool"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "fd"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "libass"
brew "pango"
brew "srt"
brew "tesseract"
brew "zeromq"
brew "ffmpeg"
brew "ffmpeg@4"
brew "figlet"
brew "flow"
brew "libtool"
brew "fontforge"
brew "freetds"
brew "gcc@4.9"
brew "gcc@5"
brew "gd"
brew "gdb"
brew "gdk-pixbuf"
brew "gh"
brew "libidn"
brew "ghostscript"
brew "ghq"
brew "gibo"
brew "git"
brew "git-extras"
brew "git-lfs"
brew "glslang"
brew "gnu-sed"
brew "go"
brew "gobject-introspection"
brew "gource"
brew "netpbm"
brew "gts"
brew "librsvg"
brew "graphviz"
brew "guetzli"
brew "guile"
brew "hashpump"
brew "haskell-stack"
brew "httpflow"
brew "httpie"
brew "hunspell"
brew "ilmbase"
brew "shared-mime-info"
brew "libheif"
brew "python@3.8"
brew "imagemagick"
brew "imagemagick@6"
brew "imagesnap"
brew "iproute2mac"
brew "jid"
brew "jpegoptim"
brew "oniguruma"
brew "jq"
brew "kotlin"
brew "krb5"
brew "leiningen"
brew "lha"
brew "libfido2"
brew "libmagic"
brew "libpq"
brew "libproxy"
brew "libwebsockets"
brew "libxmlsec1"
brew "lua"
brew "lv"
brew "lynx"
brew "ruby"
brew "macvim"
brew "mas"
brew "mercurial"
brew "minicom"
brew "minikube"
brew "mono-libgdiplus"
brew "mosquitto"
brew "mysql"
brew "n"
brew "neovim"
brew "nghttp2"
brew "nginx"
brew "nkf"
brew "nmap"
brew "node", link: false
brew "nyancat"
brew "oath-toolkit"
brew "protobuf"
brew "vtk"
brew "opencv"
brew "python@3.10"
brew "opencv@3"
brew "packer"
brew "pacvim"
brew "pandoc"
brew "peco"
brew "perl"
brew "php"
brew "php@7.4"
brew "pipenv"
brew "pngcheck"
brew "pngquant"
brew "portaudio"
brew "postgresql@10"
brew "postgresql@12"
brew "postgresql@13"
brew "postgresql@14"
brew "pup"
brew "pwgen"
brew "pyenv"
brew "pyenv-virtualenv"
brew "qt"
brew "pyqt"
brew "python-tk@3.9"
brew "ruby-build"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "redis"
brew "rlwrap"
brew "rmtrash"
brew "rtv"
brew "rust"
brew "shadowsocks-libev"
brew "sip"
brew "sl"
brew "socat"
brew "source-highlight"
brew "starship"
brew "swiftlint"
brew "telnet"
brew "terminal-notifier"
brew "terraform"
brew "tig"
brew "tmux"
brew "tofrodos"
brew "tokei"
brew "tree"
brew "vim", args: ["HEAD"], link: false
brew "w3m"
brew "watch"
brew "watchman"
brew "wget"
brew "wine"
brew "yarn"
brew "zplug"
brew "zsh"
brew "cloudfoundry/tap/cf-cli"
brew "fumiyas/echo-sd/echo-sd"
brew "heroku/brew/heroku"
brew "jlhonora/lsusb/lsusb"
brew "microsoft/mssql-release/msodbcsql17"
brew "microsoft/mssql-release/mssql-tools"
brew "petere/postgresql/postgresql@11"
brew "sanemat/font/ricty"
brew "stevenpack/tap/asroute"
cask "1password"
cask "adoptopenjdk8"
cask "alfred"
cask "android-studio"
cask "appcode"
cask "atom"
cask "balsamiq-mockups"
cask "basictex"
cask "bathyscaphe"
cask "bettertouchtool"
cask "chromium"
cask "dash"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "dropbox"
cask "firefox"
cask "font-hack-nerd-font"
cask "franz"
cask "gimp"
cask "google-chrome"
cask "google-cloud-sdk"
cask "graphiql"
cask "hyper"
cask "hyperswitch"
cask "insomnia"
cask "intellij-idea"
cask "iterm2"
cask "kap"
cask "keyboard-cleaner"
cask "keycastr"
cask "kindle"
cask "launchcontrol"
cask "minecraft"
cask "ngrok"
cask "pycharm"
cask "rubymine"
cask "sketch"
cask "skim"
cask "skitch"
cask "skype"
cask "slack"
cask "steam"
cask "vagrant"
cask "vlc"
cask "webstorm"
cask "xquartz"
mas "Actions", id: 1586435171
mas "Audio Record - Audio Recorder1", id: 987725641
mas "BetterSnapTool", id: 417375580
mas "Cyberduck", id: 409222199
mas "Evernote", id: 406056744
mas "Folder Peek", id: 1615988943
mas "GarageBand", id: 682658836
mas "GrandPerspective", id: 1111570163
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LadioCast", id: 411213048
mas "LanScan", id: 472226235
mas "LINE", id: 539883307
mas "Microsoft Remote Desktop", id: 1295203466
mas "MindNode", id: 1289197285
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Perculia", id: 1462633284
mas "QR Capture", id: 1369524274
mas "ScanSnap Cloud", id: 1035516352
mas "Shazam", id: 897118787
mas "Silicon Info", id: 1542271266
mas "Sim Daltonism", id: 693112260
mas "TEPRA SMA3", id: 704088911
mas "The Unarchiver", id: 425424353
mas "Tomato One", id: 907364780
mas "TypingLand", id: 1568264476
mas "Xcode", id: 497799835
vscode "aki77.rails-db-schema"
vscode "alanz.vscode-hie-server"
vscode "amlovey.shaderlabvscodefree"
vscode "amodio.amethyst-theme"
vscode "anozon.maai-cursor"
vscode "Arjun.swagger-viewer"
vscode "astro-build.astro-vscode"
vscode "asvetliakov.vscode-neovim"
vscode "AyakoSky.fluffy-dark-theme"
vscode "AykutSarac.jsoncrack-vscode"
vscode "azemoh.one-monokai"
vscode "betterthantomorrow.calva"
vscode "betterthantomorrow.calva-spritz"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "blanu.vscode-styled-jsx"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "bung87.rails"
vscode "bung87.vscode-gemfile"
vscode "carlos18mz.cyberpunk-2077-rebuild"
vscode "castwide.solargraph"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "circledev.glsl-canvas"
vscode "cpylua.language-postcss"
vscode "cweijan.vscode-mysql-client2"
vscode "dbaeumer.vscode-eslint"
vscode "dseight.disasexpl"
vscode "dtoplak.vscode-glsllint"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "emeraldwalk.RunOnSave"
vscode "esafirm.kotlin-formatter"
vscode "esbenp.prettier-vscode"
vscode "felixfbecker.php-intellisense"
vscode "file-icons.file-icons"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "formulahendry.github-actions"
vscode "fwcd.kotlin"
vscode "gamunu.vscode-yarn"
vscode "gcazaciuc.vscode-flow-ide"
vscode "genieai.chatgpt-vscode"
vscode "github.classroom"
vscode "GitHub.copilot"
vscode "GitHub.copilot-labs"
vscode "GitHub.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "gitpod.gitpod-desktop"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "Hridoy.rails-snippets"
vscode "humao.rest-client"
vscode "idered.npm"
vscode "ilich8086.classic-asp"
vscode "janisdd.vscode-edit-csv"
vscode "jebbs.plantuml"
vscode "julialang.language-julia"
vscode "justusadam.language-haskell"
vscode "kaiwood.endwise"
vscode "kalitaalexey.vscode-rust"
vscode "Kelvin.vscode-sshfs"
vscode "kenhowardpdx.vscode-gist"
vscode "mathiasfrohlich.Kotlin"
vscode "maximedenes.vscoq"
vscode "mechatroner.rainbow-csv"
vscode "misogi.ruby-rubocop"
vscode "mjmcloug.vscode-elixir"
vscode "mkloubert.vscode-http-client"
vscode "mosapride.zenkaku"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.black-formatter"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-serial-monitor"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mysql"
vscode "mtxr.sqltools-driver-pg"
vscode "mtxr.sqltools-driver-sqlite"
vscode "narumincho.definy"
vscode "naumovs.color-highlight"
vscode "negokaz.zenn-editor"
vscode "njqdev.vscode-python-typehint"
vscode "noku.rails-run-spec-vscode"
vscode "oderwat.indent-rainbow"
vscode "onecentlin.laravel-blade"
vscode "Orta.vscode-jest"
vscode "pbkit.vscode-pbkit"
vscode "peakchen90.open-html-in-browser"
vscode "phoenisx.cssvar"
vscode "PKief.material-icon-theme"
vscode "Prisma.prisma"
vscode "pucelle.run-on-save"
vscode "quicktype.quicktype"
vscode "rebornix.ruby"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "ryu1kn.partial-diff"
vscode "sianglim.slim"
vscode "silesky.toggle-boolean"
vscode "SimonSiefke.svg-preview"
vscode "slevesque.shader"
vscode "stuart.unique-window-colors"
vscode "styled-components.vscode-styled-components"
vscode "syler.sass-indented"
vscode "taichi.vscode-textlint"
vscode "takuyaw-w.swapman"
vscode "tamasfe.even-better-toml"
vscode "tamj0rd2.ts-quickfixes-extension"
vscode "toba.vsfire"
vscode "tommasov.hosts"
vscode "tomoyukim.vscode-mermaid-editor"
vscode "tonybaloney.vscode-pets"
vscode "unifiedjs.vscode-mdx"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "Vue.volar"
vscode "WakaTime.vscode-wakatime"
vscode "wangtao0101.vscode-js-import"
vscode "wferris.vs-asp-classic"
vscode "whizkydee.material-palenight-theme"
vscode "WillLuke.nextjs"
vscode "wingrunr21.vscode-ruby"
vscode "wwmyers.hackpot"
vscode "xabikos.JavaScriptSnippets"
vscode "xaver.clang-format"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.vscode-styled-jsx-languageserver-scss"
